{
  "main": {
    "name":"Pranav Kulkarni",
    "occupation":"Masters Student of Software Engineering @ University of Maryland (Fall 2018-2020)",
    "description":"I have strong interest in the field of Software Developement, AI/ML, Finance, Robotics and any combination of these. I am proficient in Javascript, Python, C++, R, MySQL and have an experience working in React/Redux, Node & Express JS, High-performance/Super computing platforms, PostgreSql, Pandas, Postman, Git, SSH, ArcGIS, ROS & Linux. I am currently looking for full-time positions from May 2020 in any of the following: Software developer, full-stack developer, React/Redux developer, Javascript developer, Front-end developer, Back-end developer, Python developer, C++ developer",
    "image":"profilepic.jpg",
    "bio":"I was born and raised in a lovely city called 'Pune' in India. After my basic schooling there, I did my graduation from the Indian Institute of Technology Patna, India from the department of Mechanical Engineering (2012 - 2016). Currently, I am doing my Masters in Software Engineering from the University of Maryland (Fall 2018 - 2020). Apart from my strong liking towards Software Development and coding in general, I like reading books especially from mythology, mystery, science fiction, business/entrepreneurship & political satire genres. I also like watching good movies and I am a big fan of Christopher Nolan and Denis Villeneuve. Apart from all of this, I do enjoy playing chess in the pass-time.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "pranav08@terpmail.umd.edu",
    "phone": "301-851-1822",
    "address":{
      "street":"5043, Berwyn road",
      "city":"College Park",
      "state":"Maryland",
      "zip": "20740"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"https://drive.google.com/file/d/1EFt1zt1LkvKJq3XzUpkr2Xjso_fYihcI/view?usp=sharing",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/pranav-kulkarni-6a699192/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"http://github.com/pranav2308",
        "className":"fa fa-github"
      },
      {
        "name":"HackerRank",
        "url":"https://www.hackerrank.com/pranav08",
        "className":"fas fa-file-code"
      }
    ]
  },
  "resume":{
    "skillmessage":"Short visual summary of some of my skills",
    "education":[
      {
        "school":"University of Maryland",
        "degree":"Masters in Software Engineering",
        "graduated":"May 2020 (Expected)",
        "description":"Have undertaken courses in Software Architecture, requirements, Systems Engineering, AI Planning and Life-cycle cost estimation. Currently a graduate research assistant to Dr. Varaprasad Bandaru at Dept. of Geographical Sciences."
      },
      {
        "school":"Indian Institute of Technology Patna",
        "degree":"B.Tech in Mechanical Engineering",
        "graduated":"August 2016",
        "description":"Received Director's 'Best Graduate Thesis Project Award 2016', Published a paper in American Society in ME and was selected in coveted MITACS Globalinks scholarship."
      }
    ],
    "work":[
      {
        "company":"Dept. of Geographical Sciences, University of Maryland",
        "title":"Graduate Student Researcher",
        "years":"June 2019 - Present",
        "description":"I have developed 7+ packages & supporting modules for performing data extraction, pre-processing, bias-correction and down-scaling of CFS and SubX Multi Model Ensemble (MME) satellite-based weather datasets (200+GB in size). Apart from this, I have also automated and increased the efficiency of GIS based data analysis system used for conducting large scale simulations at high-spatial resolutions by using EPIC crop model by reducing its simulation time by ~ 60%. Finally, I have also performed EPIC crop model simulations for 3 different crops (from 2012-2015), its subsequent post-processing and validation at national-scale (with ~ 1KM spatial resolution) and I am currently in-process of publishing the results.",
        "environment":"R, Python, high-performance clusters, Bridges & Comet super computing platforms, SSH, Linux."
      },
      {
        "company":"Web application - freelance projects",
        "title":"Web application developer",
        "years":"August 2019 - Present",
        "description":"I have developed full-stack interactive web-applications for 1. Visualization based asset allocation computing tool for investors as Beta-manager (https://beta-manager.herokuapp.com/) & 2. Tool for detecting celebrities and human faces in uploaded image as CeleFace (https://celeface.herokuapp.com/). I have also developed 3+ wireframes & 7+ UML diagrams for UX design, internal application flow and state management and worked as an implementation lead for developing prototype of online cooking learning management system named MasterCook (https://mastercook613.herokuapp.com/) for semester-wide course project in a group of 6.",
        "environment":"React/Redux, Express & Node JS, HTML5, CSS3, PostgreSql, Firebase, Postman, Heroku, Git."
      },
      {
        "company":"Quantitative team @ Smith investment Fund (SIF) - UMD",
        "title":"Technical Lead",
        "years":"November 2018 - Present",
        "description":"I developed REST API for ‘Beta’ parameter computation, Hierarchical Risk Parity (HRP) computation & for asset-screener for ‘Quality Companies at Reasonable Price (QARP)’ software model. (More info on SIF can be found at https://www.umdsmithinvestmentfund.com/). I have also conducted 2+ Q&A sessions & lecture series on ‘Intro to Basic SoftDev tools’ for new recruits in the club. ",
        "environment":"Python, Pandas, Selenium, Google datalab, Quandl, Git."
      },
      {
        "company":"Dept. of Aerospace Engineering - UMD",
        "title":"Research Assistant",
        "years":"Aug 2018 - May 2019",
        "description":"I assisted to Dr. Huan Xu, for developing RESTful API for generating an optimized multi-robot control policy based on automata learning of environmental dynamics to satisfy given LTL specifications with maximum probability. For developing the same, I studied 15+ related research papers and conducted path planning simulations by leveraging public packages.",
        "environment":"Python, SimPy, Linux, ROS."
      },
      {
        "company":"Mechatronics Lab - IIT Patna",
        "title":"Research Assistant",
        "years":"Aug 2015 - Apr 2016",
        "description":"I developed an optimized feedback algorithm for automated trajectory planning of ferromagnetic microbots used for targeted cell deliveries via cell-micromanipulation in presence of undesired forces and sensing noise. For this project, I received Institute’s ‘Best Graduate Thesis Project Award 2016’ for the developed algorithm and prepared thesis. I was also able to publishe and present the research findings in ASME 10th International Conference on Micro-Nano systems. By leveraging the developed algorithm, I developed the framework for accurate and fast tracking of pre-defined trajectories by microbots and led the team of 4 for the ‘Mobile Micro-robotics Challenge 2016’ (organised by IEEE RAS) to achieve the rank of top 3 finalists.",
        "environment":"Python, C++, pygame, SimPy, MATLAB, Linux."
      },
      {
        "company":"Craft Systems, India",
        "title":"Project Manager",
        "years":"May 2017 - Apr 2018",
        "description":"I was lead CNC mill programmer for 3, 4 & 5-axis bar fed mill for development of prototypes & production parts. Apart from this, I also performed regular troubleshootings and enforced Lean 5S throughout the shop for maximizing operator time & safety."
      },
      {
        "company":"Hindustan Petroleum Corporation Limited",
        "title":"Officer – Retail Upgradation",
        "years":"Jul 2016 - Apr 2017",
        "description":"I worked as an interface between customer and developers for implementation of retail automation software at 103+ outlets. For the same purpose, I used to extract requirements from customers for troubleshooting, product support & improvement in developed software. I also worked closely with development team for requirements prioritization and quicker and improved resolution of first ticket issues."
      }
    ],
    "skills":[
      {
        "name":"Python",
        "level":"90%"
      },
      {
        "name":"Javascript",
        "level":"85%"
      },
      {
        "name":"C++",
        "level":"80%"
      },
      {
        "name":"R",
        "level":"85%"
      },
      {
        "name":"C",
        "level":"70%"
      },
      {
        "name":"Assembly (x86 Intel syntax)",
        "level":"60%"
      },
      {
        "name":"CSS3",
        "level":"70%"
      },
      {
        "name":"HTML5",
        "level":"80%"
      },
      
      {
        "name":"React/Redux",
        "level":"75%"
      },
      {
        "name":"NodeJS",
        "level":"75%"
      },
      {
        "name":"Pandas",
        "level":"60%"
      },
      {
        "name":"PostgreSql",
        "level":"90%"
      },      
      {
        "name":"MongoDB",
        "level":"60%"
      },
      {
        "name":"Git",
        "level":"80%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Beta-manager",
        "category":"Visualization based allocation computing tool for investors",
        "image":"beta_manager.png",
        "url":"https://beta-manager.herokuapp.com/"
      },
      {
        "title":"CeleFace",
        "category":"Celebrity and Face detection app",
        "image":"celeface.png",
        "url":"http://celeface.herokuapp.com/"
      },
      {
        "title":"MasterCook",
        "category":"prototype of online cooking learning management system",
        "image":"mastercook.png",
        "url":"https://mastercook613.herokuapp.com/"
      },
      {
        "title":"Portfolio Website",
        "category":"A React based portfolio website",
        "image":"portfolio.png",
        "url":"https://pranav2308.github.io/portfoliopranav/"
      }
    ]
  }
}
